cf_billing/Documents/энргЭтапПретензионноИсковойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргЭтапПретензионноИсковойДеятельности</Name>
			<BasedOn>
				<xr:Item>Document.энргЭтапПретензионноИсковойДеятельности</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргЭтапыПретензионноИсковойДеятельности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительныйЛистДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительныйЛистНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргЭтапПретензионноИсковойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗадолженностиКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗадолженностиНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаГоспошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПеня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПИД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращенаДеятельность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Долги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДолга</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоИсполнительномуЛисту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУтвержденная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргЭтапыПретензионноИсковойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЭтапыПретензионноИсковойДеятельности</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСледЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрекращенаДеятельность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСрокиЭтаповПИД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСрокиЭтаповПИД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСхемыПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Юридическая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подэтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргЭтапПретензионноИсковойДеятельности/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если не ЭтапПИД = Документы.энргЭтапПретензионноИсковойДеятельности.ПервыйЭтап_ПИД() тогда
		ПроверяемыеРеквизиты.добавить("Основание");
	КонецЕсли;  	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
			
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();	
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ЭтапУжеПройден() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту """ + Абонент + """ этап """ + ЭтапПИД + """ уже пройден");
		Отказ 				= истина;
		Возврат;
	КонецЕсли; 
	
	Запись 						  = Движения.энргЭтапыПретензионноИсковойДеятельности.Добавить();
	Запись.Абонент 				  = Абонент;
	Запись.Период				  = Дата;
	Запись.Этап					  = ЭтапПИД;
	Запись.Поставщик			  = Поставщик;
	Запись.НачалоПериода		  = ПериодЗадолженностиНачало;
	Запись.КонецПериода			  = ПериодЗадолженностиКонец;
	Запись.ДатаСледЭтапа		  = ДатаСледЭтапа;
	Запись.Ответственный		  = Ответственный;
	Запись.ПрекращенаДеятельность = ПрекращенаДеятельность;
	Запись.Организация		 	  = Организация;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено тогда
		Возврат;
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Дата,Номер,ПериодНачисления");
	
	ПредыдущийЭтап 									= ДанныеЗаполнения.ЭтапПИД; 
	ЭтапПИД  										= СледующийЭтапПИД(ПредыдущийЭтап);
	Основание 										= ДанныеЗаполнения;
	
	Если ЭтапПИД = Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_РешениеСуда тогда
		// Заполняем табличную часть
		Долги.Очистить();
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаГоспошлина) тогда
			СтрокаТЧ  								= Долги.Добавить();
			СтрокаТЧ.ВидДолга 						= "Гос пошлина";
			СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаГоспошлина;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаПеня) тогда
			СтрокаТЧ  								= Долги.Добавить();
			СтрокаТЧ.ВидДолга 						= "Пеня";
			СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаПеня;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаЗадолженности) тогда
			СтрокаТЧ  								= Долги.Добавить();
			СтрокаТЧ.ВидДолга 						= "Сумма основного долга";
			СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаЗадолженности;
		КонецЕсли; 
	КонецЕсли; 	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДатуСледЭтапа() Экспорт 

	Если Не ЗначениеЗаполнено(ЭтапПИД) Или Не ЗначениеЗаполнено(Организация) Или ЗначениеЗаполнено(ДатаСледЭтапа) Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;

	ТекДата = Дата;
	Если Не ЗначениеЗаполнено(ТекДата) Тогда
		ТекДата = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСрокиЭтаповПИДСрезПоследних.Срок КАК Срок
		|ИЗ
		|	РегистрСведений.энргСрокиЭтаповПИД.СрезПоследних(
		|			&ТекДата,
		|			Организация = &Организация
		|				И Этап = &Этап) КАК бестСрокиЭтаповПИДСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("Этап", ЭтапПИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат НачалоДня(ТекДата) + Выборка.Срок * 24 * 60 * 60;
	Иначе
		Возврат НачалоДня(ТекДата) + 30 * 24 * 60 * 60;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СледующийЭтапПИД(ПредыдущийЭтап)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПредыдущийЭтап",ПредыдущийЭтап);
	Запрос.Текст 	="ВЫБРАТЬ
	             	 |	энргВидыОперацийПИД.Ссылка КАК Этап
	             	 |ИЗ
	             	 |	(ВЫБРАТЬ
	             	 |		МИНИМУМ(энргВидыОперацийПИД.Порядок) КАК Порядок
	             	 |	ИЗ
	             	 |		Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
	             	 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             	 |				энргВидыОперацийПИД.Порядок КАК Порядок
	             	 |			ИЗ
	             	 |				Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
	             	 |			ГДЕ
	             	 |				энргВидыОперацийПИД.Ссылка = &ПредыдущийЭтап) КАК ВложенныйЗапрос
	             	 |			ПО (ВложенныйЗапрос.Порядок < энргВидыОперацийПИД.Порядок)) КАК ВложенныйЗапрос
	             	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
	             	 |		ПО ВложенныйЗапрос.Порядок = энргВидыОперацийПИД.Порядок";
	результат  = Запрос.Выполнить();
	Если результат.Пустой() тогда
		Возврат Справочники.энргВидыОперацийПИД.ПустаяСсылка();
	иначе
		Выборка = результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Этап;
	КонецЕсли; 
КонецФункции 

Функция ЭтапУжеПройден()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Абонент",		Абонент);
	Запрос.УстановитьПараметр("Этап",			ЭтапПИД);
	Запрос.УстановитьПараметр("НачалоПериода",	ПериодЗадолженностиНачало);
	Запрос.УстановитьПараметр("КонецПериода",	ПериодЗадолженностиКонец);
	Запрос.УстановитьПараметр("ТекДок",			Ссылка);
	Запрос.УстановитьПараметр("Поставщик",		Поставщик);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргЭтапыПретензионноИсковойДеятельности.Период
	|ИЗ
	|	РегистрСведений.энргЭтапыПретензионноИсковойДеятельности КАК энргЭтапыПретензионноИсковойДеятельности
	|ГДЕ
	|	энргЭтапыПретензионноИсковойДеятельности.Абонент = &Абонент
	|	И НЕ энргЭтапыПретензионноИсковойДеятельности.Регистратор = &ТекДок
	|	И энргЭтапыПретензионноИсковойДеятельности.Этап = &Этап
	|	И энргЭтапыПретензионноИсковойДеятельности.Поставщик = &Поставщик
	|	И (НЕ энргЭтапыПретензионноИсковойДеятельности.НачалоПериода > &КонецПериода
	|			ИЛИ НЕ энргЭтапыПретензионноИсковойДеятельности.КонецПериода > &НачалоПериода
	|			ИЛИ энргЭтапыПретензионноИсковойДеятельности.НачалоПериода > &НачалоПериода
	|				И энргЭтапыПретензионноИсковойДеятельности.КонецПериода < &КонецПериода)";	
	
	Результат  = Запрос.Выполнить();
	Возврат не Результат.Пустой();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
